- pandas removing column name fom data frame 
- dataframe.drop(columns="col name")
- dataframe.drop(columns=["col1","col2...])
- dataframe.drop(columns=DataFrame.Obj.columns[colNumber])

In [6]:
# removing the columns name from data frame:-
import pandas as pd
# get the data from student.csv
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\ModifiedstudentData.csv")
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
0           0    1  dhurvi   98   100       99    297        300       99.00
1           1    2  deepak   95    96       92    283        300       94.33
2           2    3    itty   95    96       94    285        300       95.00
3           3    4  rossum   99    98       93    290        300       96.67

In [7]:
# to delete one columns completely
# remove the sno
# syntax : dataframe.drop(columns-"col-name")

In [8]:
print(df.drop(columns="sno"))

   Unnamed: 0    name  eng  math  science  total  fullMarks  percentage
0           0  dhurvi   98   100       99    297        300       99.00
1           1  deepak   95    96       92    283        300       94.33
2           2    itty   95    96       94    285        300       95.00
3           3  rossum   99    98       93    290        300       96.67

In [9]:
# to make delete permanet use inplace=true

In [10]:
# to delete two columns at once
# syntax :- dataframe.drop(columns=["col1","col2",..])
# eg:-
print(df.drop(columns=["eng","math"]))

   Unnamed: 0  sno    name  science  total  fullMarks  percentage
0           0    1  dhurvi       99    297        300       99.00
1           1    2  deepak       92    283        300       94.33
2           2    3    itty       94    285        300       95.00
3           3    4  rossum       93    290        300       96.67

In [11]:
# to make it permanent inplace=true
# print(df.drop(columns=["eng","math"],inplace=True))

In [12]:
# removing the columns names from dataframe based on columns number
# syntax:- dataframe.drop(columns-dataframeobj.columns["col1","col2"..])
# df.drop(columns=df.columns[[2,4]],inplace=true)

In [13]:
# removing the ROWS from the data frame
# to delete one row

In [14]:
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\ModifiedstudentData.csv")
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
0           0    1  dhurvi   98   100       99    297        300       99.00
1           1    2  deepak   95    96       92    283        300       94.33
2           2    3    itty   95    96       94    285        300       95.00
3           3    4  rossum   99    98       93    290        300       96.67

In [15]:
#suntax: - dataframeObj.drop(label=index,value,axis=0)
# axis=0 means row and axis=1 means column
# df.drop(labelss=[index1,index2,...,axis=0,inplace=True)

In [16]:
# removing the records from database/ row
# syntax: - dataframeObj.drop(label=index,value,axis=0)

In [17]:
print(df.drop(labels=[1,3],axis=0))

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
0           0    1  dhurvi   98   100       99    297        300        99.0
2           2    3    itty   95    96       94    285        300        95.0

In [18]:
# apply for loop
# df.drop(labels=[int(y) for y in range(7,12)],axis=0,inplace=True))

In [19]:
# remove the index based on user choice

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:

# syntax: dataframeObj.drop(df.index[randomIndex1,randomIndex2,...],axis=0,inplace=True)

# df.drop(df.index[[1,3,14]])

In [22]:
# sorting the data from dataframe

In [23]:
# sorting the name based on alphabetical order

In [24]:
# syntax: dataframeObj.sort_values(by="colname",ascending=True/False)

In [25]:
df.sort_values(["name"],ascending=True,inplace=True)
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
1           1    2  deepak   95    96       92    283        300       94.33
0           0    1  dhurvi   98   100       99    297        300       99.00
2           2    3    itty   95    96       94    285        300       95.00
3           3    4  rossum   99    98       93    290        300       96.67

In [26]:
# reverse the order
df.sort_values(["name"][::-1],inplace=True)
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
1           1    2  deepak   95    96       92    283        300       94.33
0           0    1  dhurvi   98   100       99    297        300       99.00
2           2    3    itty   95    96       94    285        300       95.00
3           3    4  rossum   99    98       93    290        300       96.67

In [27]:
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
1           1    2  deepak   95    96       92    283        300       94.33
0           0    1  dhurvi   98   100       99    297        300       99.00
2           2    3    itty   95    96       94    285        300       95.00
3           3    4  rossum   99    98       93    290        300       96.67

In [28]:
df.sort_values(["name"],ascending=False,inplace=True)
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
3           3    4  rossum   99    98       93    290        300       96.67
2           2    3    itty   95    96       94    285        300       95.00
0           0    1  dhurvi   98   100       99    297        300       99.00
1           1    2  deepak   95    96       92    283        300       94.33

In [29]:
# get the math result
df.sort_values(["math"],ascending=True,inplace=True)
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
2           2    3    itty   95    96       94    285        300       95.00
1           1    2  deepak   95    96       92    283        300       94.33
3           3    4  rossum   99    98       93    290        300       96.67
0           0    1  dhurvi   98   100       99    297        300       99.00

In [30]:
# get the highest secured max marks and names
df.tail(2)[["name","math"]]

     name  math
3  rossum    98
0  dhurvi   100

In [31]:
# or
df[-2:-1]

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
3           3    4  rossum   99    98       93    290        300       96.67

In [32]:
df[-2:-1][["name","math"]]

     name  math
3  rossum    98

In [33]:
df[-2:][["name","math"]][::-1]

     name  math
0  dhurvi   100
3  rossum    98

In [34]:
# find the second least highest marks with name

In [35]:
df[1:2][["name","math"]]

     name  math
1  deepak    96

In [36]:
1.12

1.12

In [37]:
# knowing the duplicate data in data frame
# syntax: dataframeObj.duplicated()--> gives the boolean result
# syntax: dataframeObj.duplicated(subset=["col1","col2",..],keep="first/last/all")

In [38]:
# removing duplicated data 
# syntax: dataframeObj.drop_duplicates(inplace=True)

In [39]:
df.duplicated()

2    False
1    False
3    False
0    False
dtype: bool

In [40]:
# remove dulpicate
df.drop_duplicates(inplace=True)
print(df)

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
2           2    3    itty   95    96       94    285        300       95.00
1           1    2  deepak   95    96       92    283        300       94.33
3           3    4  rossum   99    98       93    290        300       96.67
0           0    1  dhurvi   98   100       99    297        300       99.00

In [ ]:
# find the name of the student whose name start with "d"

In [41]:
df.columns

Index(['Unnamed: 0', 'sno', 'name', 'eng', 'math', 'science', 'total',
       'fullMarks', 'percentage'],
      dtype='object')

In [44]:
df["name"]

2      itty
1    deepak
3    rossum
0    dhurvi
Name: name, dtype: object

In [46]:
# or 
df.loc[::,["name"]]

     name
2    itty
1  deepak
3  rossum
0  dhurvi

In [47]:
df.loc[df["name"].str.startswith("d")]

   Unnamed: 0  sno    name  eng  math  science  total  fullMarks  percentage
1           1    2  deepak   95    96       92    283        300       94.33
0           0    1  dhurvi   98   100       99    297        300       99.00

In [51]:
# or 
for sname in df["name"]:
    
    if (sname.startswith("d") or sname.startswith("D")):
        print(sname,type(sname))

deepak <class 'str'>
dhurvi <class 'str'>

In [52]:
# or 
for sname in df["name"]:
    if(sname[0] in ["d","D"]):
        print(sname,type(sname))

deepak <class 'str'>
dhurvi <class 'str'>